==================
has host names
==================

HashKnownHosts yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
do not has host names
==================

HashKnownHosts no

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
use irregular casing
==================

HashKnownHOSts yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
can use equals sign
==================

HashKnownHOSts=yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
can use equals sign with whitespace
==================

HashKnownHOSts = yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
can be specified after host
==================

Host example.com
  HashKnownHosts no

---

(client_config
  (host
    (host_value))
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
detect invalid values
==================

HashKnownHOSts ja

---

(client_config
  (ERROR
    (UNEXPECTED 'j')))
