==================
use configured identities only
==================

IdentitiesOnly yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
do not use configured identities only
==================

IdentitiesOnly no

---

(client_config
  (identities_only
    (identities_only_value)))

==================
use irregular casing
==================

IdentitIESOnly yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
can use equals sign
==================

IdentitIESOnly=yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
can use equals sign with whitespace
==================

IdentitIESOnly = yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
can be specified after host
==================

Host example.com
  IdentitiesOnly no

---

(client_config
  (host
    (host_value))
  (identities_only
    (identities_only_value)))

==================
detect invalid values
==================

IdentitIESOnly ja

---

(client_config
  (ERROR
    (UNEXPECTED 'j')))
