================================================================================
Selection statement (simple if)
================================================================================

if true
	234
endif

--------------------------------------------------------------------------------

(source_file
  (build_definition
    (statement
      (selection_statement
        (condition
          (expression
            (boolean_literal)))
        (statement
          (expression
            (integer_literal)))))))

================================================================================
Selection statement (simple if/else)
================================================================================

if true
	234
else
  'super trouper'
endif

--------------------------------------------------------------------------------

(source_file
  (build_definition
    (statement
      (selection_statement
        (condition
          (expression
            (boolean_literal)))
        (statement
          (expression
            (integer_literal)))
        (statement
          (expression
            (string_literal
              (string_simple))))))))

================================================================================
Selection statement (simple if/elif/else)
================================================================================

if true
	234
elif true
  false
elif true
  []
else
  'super trouper'
endif

--------------------------------------------------------------------------------

(source_file
  (build_definition
    (statement
      (selection_statement
        (condition
          (expression
            (boolean_literal)))
        (statement
          (expression
            (integer_literal)))
        (condition
          (expression
            (boolean_literal)))
        (statement
          (expression
            (boolean_literal)))
        (condition
          (expression
            (boolean_literal)))
        (statement
          (expression
            (array_literal)))
        (statement
          (expression
            (string_literal
              (string_simple))))))))

================================================================================
Assignment
================================================================================

foo = 'bar'

--------------------------------------------------------------------------------

(source_file
  (build_definition
    (statement
      (assignment_statement
        (expression
          (primary_expression
            (id_expression)))
        (assignment_operator)
        (expression
          (string_literal
            (string_simple)))))))

================================================================================
Path join
================================================================================

joined = '/usr/share' / 'projectname'

--------------------------------------------------------------------------------

(source_file
  (build_definition
    (statement
      (assignment_statement
        (expression
          (primary_expression
            (id_expression)))
        (assignment_operator)
        (expression
          (binary_expression
            (expression
              (string_literal
                (string_simple)))
            (mult_operator)
            (expression
              (string_literal
                (string_simple)))))))))
